Revit 2027 API
BuiltInFailures.MEPFabricationFailures.FabricationOverSizedCheck Property
 Fabrication part is too large to fit on the sheet metal. Replace the part with multiple smaller parts, or notify the CAM operator.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FabricationOverSizedCheck { get; }
Public Shared ReadOnly Property FabricationOverSizedCheck As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FabricationOverSizedCheck {
	FailureDefinitionId^ get ();
}
static member FabricationOverSizedCheck : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPFabricationFailures Class
Autodesk.Revit.DB Namespace